---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainGridFamilyFailures.CurtainPanelNotBelongsToElement
source: html/0a44918c-6c12-8a93-0cf2-6f764f369921.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainGridFamilyFailures.CurtainPanelNotBelongsToElement Property

Curtain element Panel doesn't belong to Curtain element. In merging, you must select the version of a Curtain element that has had Panels added to it.

## Syntax (C#)
```csharp
public static FailureDefinitionId CurtainPanelNotBelongsToElement { get; }
```